app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-11-20 02:05:40.092415"], ["updated_at", "2018-11-20 02:05:40.092415"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-11-20 02:05:40.099181"], ["updated_at", "2018-11-20 02:05:40.099181"]]
---
  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Customer.create(song_clean: song[0], artist_clean: song[1], release_year: song[2], combined: song[3], first: song[4], year: song[5], play_count: song[6], fg: song[7])